ymaps.ready(init);

function init() {
    var myMap = new ymaps.Map("map", {
        center: [55.76, 37.64],
        zoom: 10
    });

    ymaps.modules.require(['Heatmap'], function (Heatmap) {
        var data = [
            [55.831903, 37.411961],
            [55.763338, 37.565466],
            [55.763338, 37.565255],
            [55.744522, 37.616378],
            [55.744522, 37.616378],
            [55.744522, 37.616378],
            [55.744522, 37.616378],
            [55.744422, 37.616378],
            [55.743522, 37.616278],
            [55.744722, 37.626378],
            [55.744522, 37.616178],
            [55.744922, 37.616078],
            [55.744522, 37.616378],
            [55.744522, 37.616378],
            [55.144522, 37.116378],
            // Добавьте больше координат
        ];

        var heatmap = new Heatmap(data, {
            radius: 10,
            opacity: 0.8,
            intensityOfMidpoint: 0.2,
            dissipating: true,
            gradient: {
                0.1: 'rgba(128, 255, 0, 0.8)',
                0.2: 'rgba(255, 255, 0, 0.8)',
                0.3: 'rgba(234, 72, 58, 0.8)',
                0.4: 'rgba(162, 36, 25, 0.8)',
                1.0: 'rgba(136,32,23,0.89)'
            }
        });

        heatmap.setMap(myMap);
    });
}